Revit 2026 API

# NumericRevisionSettingsIsValid Method

---

Determines whether the NumericRevisionSettings object is in a valid state.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValid()
```
```vb
Public Function IsValid As Boolean
```
```cpp
public:
bool IsValid()
```
```fsharp
member IsValid : unit -> bool
```

#### Return Value

Boolean True if the NumericRevisionSettings is valid.

The NumericRevisionSettings should at least contain a non-negative start number.

#### Reference

NumericRevisionSettings Class

Autodesk.Revit.DB Namespace